# Используем официальный образ Node.js в качестве базового образа
FROM node

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы package.json и package-lock.json внутрь контейнера
COPY package*.json ./

# Устанавливаем зависимости
RUN npm i

# Копируем все файлы проекта внутрь контейнера
COPY . .

# Собираем проект с помощью Vite
RUN npm run build

# Устанавливаем переменную окружения PORT
ENV PORT=5173

# Открываем порт, на котором будет работать приложение
EXPOSE $PORT

# Запускаем приложение
CMD ["npm", "run", "dev"]
